Enums/ВидыСпецификации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВидыСпецификации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СпецификацияПродукции</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СопутствующиеМатериалы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Комплектация</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Спецификации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>Спецификации</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Номенклатура</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидСпецификации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСпецификации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Состав</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Comment>#12082 отключена проверка заполнения</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УДАЛИТЬ_ПорядокОкругления</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ПорядкиОкругления</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОкруглятьВБольшуюСторону</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПорядокОкругленияЧислом</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФиксированноеКоличество</Name>
							<Comment>#88</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonForms/ФормаДобавленияПродукцииПоВиду/Ext/Form/Module.bsl
//#6265

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РежимДобавленияКонструкции = Параметры.Свойство("РежимДобавленияКонструкции") И Параметры.РежимДобавленияКонструкции;  //16164
		
	мШаблон = Константы.ШаблонНаименованияПродукции.Получить();
	Если НЕ ЗначениеЗаполнено(мШаблон) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В настройках программы не задан шаблон наименования продукции", , , , Отказ);
		Возврат;
	КонецЕсли;
	
	//++16164
	Если РежимДобавленияКонструкции Тогда
		ВидПродукции = Справочники.ВидыПродукции.Конструкция;
	КонецЕсли;	
	//--16164
	
	НомерРасчета = ОбщийМодуль.ПолучитьНомерНовогоРасчета(Справочники.ВидыНоменклатуры.Продукция); // №13851 было: ОбщийМодуль.ПолучитьНовыйНомерРасчетаКонструкции();
	
	НомерРасчетаПредыдущий = НомерРасчета; // №13850
	
	// Видимость колонки Артикул
	МассивЭлементов = новый Массив();
	МассивЭлементов.Добавить("МатериалыНоменклатураАртикул");
	ОбщийМодульСервер.УстановитьВидимостьКолонкиАртикулВТабличнойЧасти(ЭтаФорма, МассивЭлементов);
	
	ОбновитьВидимостьВГруппеНоменклатура(); // №13850
	
КонецПроцедуры

&НаКлиенте
Процедура ШаблонПриИзменении(Элемент)
	
	ПолучитьНаименованиеПродукции();
		
	//++ №12667
	Если Материалы.Количество() > 0 Тогда
		ОписаниеОповещения = новый ОписаниеОповещения("ПослеВопросаОбОчищенииМатериалов_ЗаполнениеПоШаблону", ЭтаФорма);
		ПоказатьВопрос(ОписаниеОповещения, "При продолжении табличная часть ""Материалы"" будет очищена, продолжить?", РежимДиалогаВопрос.ДаНет);
	Иначе
		ЗаполнитьМатериалыПоШаблону();
	КонецЕсли;
	//-- №12667
	
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	
	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат;	
	КонецЕсли;
	
	Если Номенклатура.Пустая() Тогда
	
		РезультатОбработки = СоздатьНоменклатуруПродукцииНаСервере(Шаблон, Количество);
	
		Номенклатура = РезультатОбработки.Номенклатура;
		
		Если Номенклатура.Пустая() Тогда
			
			Сообщить(РезультатОбработки.ТекстОшибки);
			Возврат;
			
		КонецЕсли;
			
	КонецЕсли;
	
	СтруктураОтвета = Новый Структура;
	СтруктураОтвета.Вставить("НомерРасчета", 	НомерРасчета);
	СтруктураОтвета.Вставить("Шаблон",			Шаблон);
	СтруктураОтвета.Вставить("Номенклатура",	Номенклатура);
	СтруктураОтвета.Вставить("Количество", 		Количество);
	
	Закрыть(СтруктураОтвета);
	
КонецПроцедуры

&НаСервере
Функция СоздатьНоменклатуруПродукцииНаСервере(Шаблон, Количество)
	
	СтруктураРезультата = Новый Структура("Номенклатура, ТекстОшибки", Справочники.Номенклатура.ПустаяСсылка(), "");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Номенклатура.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.ВидНоменклатуры В (ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.Потолок), 
	|									ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.Отрез), 
	|									ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.Продукция))
	|	И Номенклатура.Потолок_НомерРасчета = &Потолок_НомерРасчета";
	
	Запрос.УстановитьПараметр("Потолок_НомерРасчета", НомерРасчета);	
	Выборка = Запрос.Выполнить().Выбрать();	
	Если Выборка.Следующий() Тогда
		Сообщить("В справочнике уже существует номенклатура " + Выборка.Ссылка + " с указанным номером расчета");
		Возврат СтруктураРезультата;
	КонецЕсли;
		
	//ДанныеПродукции = ОбщийМодуль.ПолучитьНомерИНаименованиеПродукции(Шаблон, Спецификация);
	
	//#16283 
	//ГруппаНоменклатурыДляСоздания = Константы.ГруппаНоменклатурыДляПродукции.Получить();
	ГруппаНоменклатурыДляСоздания = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВидПродукции, "ГруппаНоменклатуры");
	
	Попытка
		НоваяСпецификацияСсылка = Справочники.Спецификации.ПолучитьСсылку(Новый УникальныйИдентификатор);
		//НоваяЕИСсылка = Справочники.ЕдиницыИзмерений.ПолучитьСсылку(Новый УникальныйИдентификатор);
		
		НоменклатураПродукции = Справочники.Номенклатура.СоздатьЭлемент();
		НоменклатураПродукции.Наименование 		= НаименованиеПродукции;
		НоменклатураПродукции.Родитель 	 		= ГруппаНоменклатурыДляСоздания;
		НоменклатураПродукции.ВидНоменклатуры 	= Справочники.ВидыНоменклатуры.Продукция;
		НоменклатураПродукции.ВидПродукции 		= ВидПродукции;
		НоменклатураПродукции.Шаблон 			= Шаблон;
		НоменклатураПродукции.БазоваяЕдиницаИзмерения = Шаблон.ЕдиницаИзмерения;
		НоменклатураПродукции.Потолок_НомерРасчета 	= НомерРасчета;	
		
		НоменклатураПродукции.ОсновнаяСпецификация = НоваяСпецификацияСсылка;
		//НоменклатураПродукции.АльтернативнаяЕдиницаИзмерения = НоваяЕИСсылка;
		
		НоменклатураПродукции.Записать();
		
		ОсновнаяСпецификацияНоменклатуры = Справочники.Спецификации.СоздатьЭлемент();
		ОсновнаяСпецификацияНоменклатуры.УстановитьСсылкуНового(НоваяСпецификацияСсылка);
		ОсновнаяСпецификацияНоменклатуры.Наименование = "Основная спецификация";
		ОсновнаяСпецификацияНоменклатуры.Владелец = НоменклатураПродукции.Ссылка;
		ОсновнаяСпецификацияНоменклатуры.ВидСпецификации = Перечисления.ВидыСпецификации.СпецификацияПродукции; //#12667
		
		//++ №12667 заполняем из материалов формы
		//Для каждого СтрокаШаблона из Шаблон.Состав Цикл
		Для каждого СтрокаШаблона из Материалы Цикл
		//++ №12667		
			НоваяСтрока = ОсновнаяСпецификацияНоменклатуры.Состав.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаШаблона);
			
			//#16479 закомментировано, т.к. добавлено поле Таблицы
			//НоваяСтрока.ФиксированноеКоличество = Истина;
			//#16479
			Если НЕ СтрокаШаблона.ФиксированноеКоличество Тогда
				НоваяСтрока.Количество = СтрокаШаблона.Количество / Количество; 
			КонецЕсли;
		КонецЦикла;
		
		ОсновнаяСпецификацияНоменклатуры.Записать();		
		
		// пока убрано
		//ЕдИзмАльтернативная = Справочники.ЕдиницыИзмерений.СоздатьЭлемент();
		//ЕдИзмАльтернативная.УстановитьСсылкуНового(НоваяЕИСсылка);
		//ЕдИзмАльтернативная.Владелец = НоменклатураПродукции.Ссылка;
		//ЕдИзмАльтернативная.Наименование = Справочники.КлассификаторЕдиницИзмерения.Штука;
		//ЕдИзмАльтернативная.Коэффициент = Количество;
		//ЕдИзмАльтернативная.Записать();
		
		СтруктураРезультата.Номенклатура = НоменклатураПродукции.Ссылка;
	Исключение
		СтруктураРезультата.ТекстОшибки = ОписаниеОшибки();
	КонецПопытки;
	
	Возврат СтруктураРезультата;
	
КонецФункции

//++ №12667
&НаКлиенте
Процедура КоличествоПриИзменении(Элемент)
	
	//++ №13850 количество меняем только если будет создаваться новая карточка
	Если НЕ Номенклатура.Пустая() Тогда
		Возврат;
	КонецЕсли;
	//-- №13850
	
	Для Каждого ТекущаяСтрока Из Материалы Цикл
		// #16479 учет ФиксированноеКоличество
		//ТекущаяСтрока.Количество = Количество * ТекущаяСтрока.КоличествоВШаблоне;
		ТекущаяСтрока.Количество = ?(ТекущаяСтрока.ФиксированноеКоличество, ТекущаяСтрока.КоличествоВШаблоне, Количество * ТекущаяСтрока.КоличествоВШаблоне);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура МатериалыНоменклатураПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Материалы.ТекущиеДанные;
	
	Если СтрокаТабличнойЧасти = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаТабличнойЧасти.ЕдиницаИзмерения = ПолучитьБазовуюЕдиницуИзмеренияНоменклатуры(СтрокаТабличнойЧасти.Номенклатура);
	СтрокаТабличнойЧасти.Коэффициент = 1;
	СтрокаТабличнойЧасти.Количество = 1;
		
КонецПроцедуры

&НаКлиенте
Процедура МатериалыЕдиницаИзмеренияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	СтрокаТабличнойЧасти = Элементы.Материалы.ТекущиеДанные;
	СписокЕдиниц = ОбщийМодуль.ПолучитьСписокЕдиницИзмеренияНоменклатуры(СтрокаТабличнойЧасти.Номенклатура);
	
	ДанныеВыбора = Новый СписокЗначений;
	Для Ном = 0 По СписокЕдиниц.Количество() - 1 Цикл
		ДанныеВыбора.Добавить(СписокЕдиниц[Ном]);
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура МатериалыЕдиницаИзмеренияПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Материалы.ТекущиеДанные;
	
	Если СтрокаТабличнойЧасти = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(СтрокаТабличнойЧасти.ЕдиницаИзмерения) = Тип("СправочникСсылка.КлассификаторЕдиницИзмерения") Тогда
		СтрокаТабличнойЧасти.Коэффициент = 1;
	Иначе
		СтрокаТабличнойЧасти.Коэффициент = ОбщийМодуль.ПолучитьКоэффициентЕдиницыИзмерения(СтрокаТабличнойЧасти.ЕдиницаИзмерения);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьБазовуюЕдиницуИзмеренияНоменклатуры(Знач Номенклатура)
	Возврат Номенклатура.БазоваяЕдиницаИзмерения;
КонецФункции

&НаКлиенте
Процедура ПослеВопросаОбОчищенииМатериалов_ЗаполнениеПоШаблону(Ответ, ДополнительныеПараметры) Экспорт 
	
	Если НЕ Ответ = КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьМатериалыПоШаблону();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьМатериалыПоШаблону()
	
	Материалы.Очистить();
	
	Для Каждого ТекущаяСтрока Из Шаблон.Состав Цикл		
		НоваяСтрока = Материалы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);		
		НоваяСтрока.КоличествоВШаблоне = НоваяСтрока.Количество;
	КонецЦикла;
	
КонецПроцедуры
//-- №12667

//++ №13850 поиск существующей карточки номенклатуры по номеру расчета, если найдётся, то все поля заполняем по ней и делаем все поля только для просмотра
&НаКлиенте
Процедура НомерРасчетаПриИзменении(Элемент)
	
	ВыполнитьПоискСуществующейКарточкиНоменклатуры();
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьПоискСуществующейКарточкиНоменклатуры()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Номенклатура.Ссылка КАК Ссылка,
	|	Номенклатура.ВидНоменклатуры КАК ВидНоменклатуры
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.ВидНоменклатуры В (ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.Потолок), 
	|									ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.Отрез), 
	|									ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.Продукция))
	|	И Номенклатура.Потолок_НомерРасчета = &Потолок_НомерРасчета";
	
	Запрос.УстановитьПараметр("Потолок_НомерРасчета", НомерРасчета);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ПозицияНайдена = Ложь;
	
	Если Выборка.Следующий() Тогда
		
		// Если добавляем Продукцию, а нашли Отрез или Потолок, то поля соответственно не заполняем по карточке номенклатуры
		// выводим сообщение и возвращаем номер расчета предыдущий
		Если Выборка.ВидНоменклатуры = Справочники.ВидыНоменклатуры.Продукция Тогда
			
			ПозицияНайдена = Истина;
			
			Номенклатура = Выборка.Ссылка;
			
			Шаблон = Номенклатура.Шаблон;
			
			// Заполняем материалы по основной спецификации
			Материалы.Очистить();
			
			Для Каждого ТекущаяСтрока Из Номенклатура.ОсновнаяСпецификация.Состав Цикл
				
				НоваяСтрока = Материалы.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
				
			КонецЦикла;
			
			НомерРасчетаПредыдущий = НомерРасчета;
			
		Иначе
			
			НомерРасчета = НомерРасчетаПредыдущий;
			Сообщить(СтрШаблон("Введенный номер расчёта используется у номенклатуры %1 с видом номенклатуры %2, номер расчёта возвращен к исходному.", Выборка.Ссылка, Выборка.ВидНоменклатуры));
			
		КонецЕсли;
		
	Иначе
		
		НомерРасчетаПредыдущий = НомерРасчета;
		
		Номенклатура = Справочники.Номенклатура.ПустаяСсылка();
		ПолучитьНаименованиеПродукции();
		
	КонецЕсли;

	// Меняем свойство "Только просмотр" по результатам поиска
	Элементы.Шаблон.ТолькоПросмотр = ПозицияНайдена;
	Элементы.Материалы.ТолькоПросмотр = ПозицияНайдена;
	
	ОбновитьВидимостьВГруппеНоменклатура();
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьНаименованиеПродукции()
	
	ДанныеПродукции = ОбщийМодуль.ПолучитьНомерИНаименованиеПродукции(НомерРасчета, Шаблон);
	НаименованиеПродукции = ДанныеПродукции.Наименование;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьВидимостьВГруппеНоменклатура()
	
	Элементы.Номенклатура.Видимость = (НЕ Номенклатура.Пустая());
	Элементы.НаименованиеПродукции.Видимость = (Номенклатура.Пустая());
	
КонецПроцедуры
//-- №13850
